print("Вітаємо вас в грі вікторині!")
print("Всі відповіді(крім формул) пишіть з великої букви")
print("Чи готові ви випробувати ваші знання в найрізноманітніших галузях науки?")
print("Якщо так тоді починаймо!")
print("Виберіть рівень складності:")
print("1-Новачок")
print("2-Учень")
print("3-Студент")
print("4-Експерт")
choice=input("Ваш вибір: ")

score=0

if choice=="1":
    print("Ви вибрали рівень Новачка")
    print("Починаймо вікторину!")

    print("1-Яка столиці України?")
    answer=input("Ваша відповідь: ")
    if answer=="Київ":
        print("Правильно! Молодець!")
        score+=1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("2-Скільки буде 5*8?")
    answer=input("Ваша відповідь: ")
    if answer=="40":
        print("Правильно! Молодець!")
        score+=1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("3-Який найбільший океан у світі?")
    answer=input("Ваша відповідь: ")
    if answer=="Тихий":
        print("Правильно! Молодець!")
        score+=1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("4-Яка найвища гора світу?")
    answer=input("Ваша відповідь: ")
    if answer=="Еверест":
        print("Правильно! Молодець!")
        score+=1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("5-Що позначає цей символ в фізиці-t?")
    answer=input("Ваша відповідь: ")
    if answer=="Час":
        print("Правильно! Молодець!")
        score+=1
    else:
        print("Неправильно. Спробуйте ще раз! ")

    print("6-Хто написав 'Кобзар?'(Ім'я і прізвище)")
    answer=input("Ваша відповідь: ")
    if answer=="Тарас Шевченко":
        print("Правильно! Молодець!")
        score+=1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("7-Яка четверта планета від Сонця?")
    answer=input("Ваша відповідь: ")
    if answer=="Марс":
        print("Правильно! Молодець!")
        score+=1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("8-Яка сума градусів кутів у трикутнику?")
    answer = input("Ваша відповідь: ")
    if answer == "180":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("9-Яка хімічна формула води?")
    answer = input("Ваша відповідь: ")
    if answer == "H2O":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("10-Яка геометрична фігура не має початку і кінця?")
    answer = input("Ваша відповідь: ")
    if answer == "Пряма":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("Ви відповіли на", score, "з 10 питань")
    if score=="10":
        print("Молодець!Тепер спробуйте вищі рівні складності!")

    else:
        print("Непогано.Спробуйте пройти цю вікторину ще раз!")

elif choice=="2":
    print("Ви вибрали рівень Учня")
    print("Починаймо вікторину!")

    print("1-Яка формула сили тяжіння?")
    answer = input("Ваша відповідь: ")
    if answer == "m*g":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("2-Який елемент в таблиці Менеделеєва має символ Cr?")
    answer = input("Ваша відповідь: ")
    if answer == "Хром":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("3-Хто написав 'Чорну Раду'?")
    answer = input("Ваша відповідь: ")
    if answer == "Пантелеймон Куліш":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("4-√225?")
    answer = input("Ваша відповідь: ")
    if answer == "15":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("5-В якому році перша людина висадилася на Місяць?")
    answer = input("Ваша відповідь: ")
    if answer == "1969":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз! ")

    print("6-Столиця Аргентини?")
    answer = input("Ваша відповідь: ")
    if answer == "Буенос-Айрес":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("7-Хто намалював Мона Лізу?")
    answer = input("Ваша відповідь: ")
    if answer == "Леонардо да Вінчі":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("8-Як називається процес утворення органічних речовин за допомогою енергії і сонячного світла?")
    answer = input("Ваша відповідь: ")
    if answer == "Фотосинтез":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("9-В якому році почалась перша світова війна?")
    answer = input("Ваша відповідь: ")
    if answer == "1914":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("10-Хто грав Стіва в Майнкрафт фільмі?")
    answer = input("Ваша відповідь: ")
    if answer == "Джек Блек":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("Ви відповіли на", score, "з 10 питань")
    if score == "10":
        print("Молодець!Тепер спробуйте вищі рівні складності!")

    else:
        print("Непогано.Спробуйте пройти цю вікторину ще раз!")

elif choice=="3":
    print("Ви вибрали рівень Студента")
    print("Починаймо вікторину!")

    print("1-Який найбільший орган в тілі людини ?")
    answer = input("Ваша відповідь: ")
    if answer == "Шкіра":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("2-Скільки сердець у восьминога?")
    answer = input("Ваша відповідь: ")
    if answer == "3":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("3-В якому році була укладена Люблінська унія?")
    answer = input("Ваша відповідь: ")
    if answer == "1569":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("4-Чи є цей рядок геометричною прогресією(Так або Ні):3,9,25,76,162?")
    answer = input("Ваша відповідь: ")
    if answer == "Ні":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("5-Який найбільший діючий вулкан в світі?")
    answer = input("Ваша відповідь: ")
    if answer == "Мауна-Лоа":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз! ")

    print("6-Яка війна сталась в 1894-1895 роках?")
    answer = input("Ваша відповідь: ")
    if answer == "Японо-китайська":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("7-Яка компанія випустила перший трискладаний смартфон?")
    answer = input("Ваша відповідь: ")
    if answer == "Huawei":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("8-Який футбольний клуб має найбільше раз перемагав у лізі чемпіонів УЄФА?")
    answer = input("Ваша відповідь: ")
    if answer == "Реал Мадрид":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("9-Найглибше озеро України?")
    answer = input("Ваша відповідь: ")
    if answer == "Світязь":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("10-Який найпоширеніший елемент на Землі?")
    answer = input("Ваша відповідь: ")
    if answer == "Кисень":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("Ви відповіли на", score, "з 10 питань")
    if score == "10":
        print("Молодець!Тепер спробуйте вищі рівні складності!")

    else:
        print("Непогано.Спробуйте пройти цю вікторину ще раз!")

elif choice=="4":
    print("Ви вибрали рівень Експерта")
    print("Починаймо вікторину!")

    print("1-Хто був засновником нової української літератури?")
    answer = input("Ваша відповідь: ")
    if answer == "Іван Котляревський":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("2-Яка найдороржча гра в світі(за бюджетом)?")
    answer = input("Ваша відповідь: ")
    if answer == "Star Citizen":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("3-Який бодібілдер виграв 8 титулів 'Містер Олімпія' поспіль і пішов у відставку непереможеним?")
    answer = input("Ваша відповідь: ")
    if answer == "Лі Хейні":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("4-Яка довжина найбільшого підвісного моста для пішоходів у світі(в метрах)?")
    answer = input("Ваша відповідь: ")
    if answer == "721":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("5-В якої тварини найдороржче молоко в світі?")
    answer = input("Ваша відповідь: ")
    if answer == "Миша":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз! ")

    print("6-Яка форма енергії відповідає за прискорення розширення Всесвіту?")
    answer = input("Ваша відповідь: ")
    if answer == "Темна енергія":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("7-Хто є автором теорії множин,яка стала основою для сучасної математики?")
    answer = input("Ваша відповідь: ")
    if answer == "Георг Кантор":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("8-Яка найдавніша мова в якої є збережені письмові докази?")
    answer = input("Ваша відповідь: ")
    if answer == "Шумерська":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("9-Яка країна найбагатша у світі за ВВП на душу населення($143 742)?")
    answer = input("Ваша відповідь: ")
    if answer == "Люксембург":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("10-Хто був найбагатшою людиної в історії(його статки оцінюються в $400-500 млрд)?")
    answer = input("Ваша відповідь: ")
    if answer == "Мансі Муса":
        print("Правильно! Молодець!")
        score += 1
    else:
        print("Неправильно. Спробуйте ще раз!")

    print("Ви відповіли на", score, "з 10 питань")
    if score == "10":
        print("Неймовірно! Тепер ви майстер цієї вікторини!!!")

    else:
        print("Непогано.Спробуйте пройти цю вікторину ще раз!")

else:
    print("Невірний вибір. Перезайдіть в гру")