# Іменник
# Колір
# Дієслово
# Назва тварини
# Назва місця
#
#
#  І видаємо текст, де замість квадратних дужок — слова, введені користувачем:
#
# Одного разу [Іменник] був дуже сумний, тому що він був [Колір]. Він вирішив [Дієслово] у [Назва місця],
# де зустрів [Назва тварини]. Разом вони вирішили залишитися в
# [Назва місця] назавжди, і стали найкращими друзі

noun = input("Введіть іменник: ")
color =input("Введіть колір: ")
verb = input("Введіть дієслово: ")
animal = input("Введіть назву тварини: ")
place = input("Введіть назву місця: ")
print("Одного разу", noun, "був дуже сумний, тому що він був", color, "Він вирішив", verb, "у", place,"де зустрів",animal,
"Разом вони вирішили залишитися в",place,"Назавжди,і стали найкращими друзями")
