print("Вітаю в грі!")
print("Тобі потрібно правильно відповісти на всі запитання")
print("Успіхів!")

score=0

print("1-Яка столиці України?")
answer=input("Ваша відповідь: ")
if answer=="Київ":
        print("Правильно! Молодець!")
        score+=1
else:
        print("Неправильно. Спробуйте ще раз!")

print("2-Хто написав 'Кобзар?'(Ім'я і прізвище)")
answer=input("Ваша відповідь: ")
if answer=="Тарас Шевченко":
        print("Правильно! Молодець!")
        score+=1
else:
        print("Неправильно. Спробуйте ще раз!")

print("3-Яка геометрична фігура не має початку і кінця?")
answer = input("Ваша відповідь: ")
if answer == "Пряма":
        print("Правильно! Молодець!")
        score += 1
else:
        print("Неправильно. Спробуйте ще раз!")

print("4-Хто написав 'Чорну Раду'?")
answer = input("Ваша відповідь: ")
if answer == "Пантелеймон Куліш":
        print("Правильно! Молодець!")
        score += 1
else:
        print("Неправильно. Спробуйте ще раз!")

print("5-Столиця Аргентини?")
answer = input("Ваша відповідь: ")
if answer == "Буенос-Айрес":
        print("Правильно! Молодець!")
        score += 1
else:
        print("Неправильно. Спробуйте ще раз!")

print("6-Хто грав Стіва в Майнкрафт фільмі?")
answer = input("Ваша відповідь: ")
if answer == "Джек Блек":
        print("Правильно! Молодець!")
        score += 1
else:
        print("Неправильно. Спробуйте ще раз!")

        print("Ви відповіли на", score, "з 6 питань")
        if score == "6":
            print("Молодець!Тепер спробуйте вищі рівні складності!")

        else:
            print("Непогано.Спробуйте пройти цю вікторину ще раз!")